Revit 2027 API
Pipe.Create Method
Overload List
Name | Description
Create(Document, ElementId, ElementId, Connector, Connector) |  Creates a new pipe that connects to two connectors.
Create(Document, ElementId, ElementId, Connector, XYZ) |  Creates a new pipe that connects to the connector.
Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ) |  Creates a new pipe from two points.
Top
See Also
Reference
Pipe Class
Autodesk.Revit.DB.Plumbing Namespace